package com.company;

/**
 * 1. 数据结构和算法概述
 *    (1) 数据结构是一门研究组织数据方式的学科;
 *    (2) 程序 = 数据结构 + 算法 (数据结构是算法的基础);
 *    (3) 要学习好数据结构就要多多考虑如何将生活中遇到的问题用程序去实际解决.
 *
 * 2. 数据结构包括的内容
 *    (1) 数据结构包括: 线性结构和非线性结构.
 *    (2) 线性结构:
 *        1> 特点: 数据元素之间存在一对一的线性关系;
 *        2> 分类: 线性结构有两种不同的存储结构, 即顺序存储结构和链式存储结构.
 *                 顺序存储的线性表称为顺序表, 顺序表中的存储元素是连续的;
 *                 链式存储的线性表称为链表, 链表中的存储元素不一定是连续的, 元素节点中存放数据元素以及相邻元素的地址信息.
 *        3> 线性结构常见的有: 数组, 队列, 链表和栈.
 *    (3) 非线性结构:
 *        1> 非线性结构包括: 二维数组, 多维数组, 广义表, 树结构, 图结构.
 */
public class 数据结构和算法内容介绍 {
}
